TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента/гкс_СвязьРегистрацииИТранспортногоДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_СвязьРегистрацииИТранспортногоДокумента</name>
  <comment>Транспортные документы регистрации</comment>
  <resources>
    <name>ТранспортныйДокумент</name>
    <type>
      <types>DocumentRef.гкс_ТранспортныйДокумент</types>
    </type>
  </resources>
  <resources>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаПеревозку</name>
    <type>
      <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументРегистрации</name>
    <type>
      <types>DocumentRef.гкс_РегистрацияНаПЛК</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_ТранспортныйДокумент/гкс_ТранспортныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ТранспортныйДокумент</name>
  <registerRecords>InformationRegister.гкс_ЖДНакладныеВагона</registerRecords>
  <attributes>
    <name>ПунктПогрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПунктРазгрузки</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРазгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.гкс_ТипыТранспортныхСредствДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияПоставки</name>
    <type>
      <types>CatalogRef.гкс_УсловияПоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВеса</name>
    <comment>Ед.измерения веса в документе</comment>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДокументПЛК</name>
    <comment>Документ создан в текущей базе</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТранспортныеСредства</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТранспортноеСредство</name>
      <type>
        <types>CatalogRef.ТранспортныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПогрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРазгрузки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесТары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФИОВодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.гкс_ЗаявкаНаПеревозку</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_СвязьРегистрацииИТранспортногоДокумента/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// Процедура добавляет запись в регистр по переданным значениям структуры.
Процедура ДобавитьЗапись(СтруктураЗаписи) Экспорт
	
    гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(
    	СтруктураЗаписи, "гкс_СвязьРегистрацииИТранспортногоДокумента");
		
КонецПроцедуры

// Удаляет набор записей в регистре по переданным значениям структуры.
//
// Параметры:
//  Запись - Структура - структура, по значениям которой необходимо удалить набор записей.
//  Загрузка - Булево - признак, выполнять загрузку в режиме обмена или нет
// 
Процедура УдалитьЗапись(Запись, Загрузка = Ложь) Экспорт
    гкс_ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(Запись, "гкс_СвязьРегистрацииИТранспортногоДокумента",
    	Загрузка);
КонецПроцедуры

#КонецОбласти

// Получает транспортный документ и транспорт для регистрации.
// 
// Параметры:
//  ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК - 
// 
// Возвращаемое значение:
//  Структура:
//  	* ТранспортныйДокумент - ДокументСсылка.гкс_ТранспортныйДокумент 
// 		* ТраснпортноеСредство - СправочникСсылка.ТранспортныеСредства  
//
Функция ПолучитьСвязьСТранспортнымДокументом(Знач ДокументРегистрации) Экспорт
	
	СтруктураСвязи = Новый Структура("ТранспортныйДокумент, ТраснпортноеСредство", 
		Документы.гкс_ТранспортныйДокумент.ПустаяСсылка(), Справочники.ТранспортныеСредства.ПустаяСсылка());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент КАК ТранспортныйДокумент,
	|	СвязьРегистрацииИТранспортногоДокумента.ТранспортноеСредство КАК ТранспортноеСредство
	|ИЗ
	|	РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
	|ГДЕ
	|	СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации = &Регистрация";
	
	Запрос.УстановитьПараметр("Регистрация", ДокументРегистрации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураСвязи, Выборка); 
	КонецЕсли;
	
	Возврат СтруктураСвязи;
	
КонецФункции

// Проверка существования связи регистрации, транспорного документа и транспорта.
// 
// Параметры:
//  Регистрация - ДокументСсылка.гкс_РегистрацияНаПЛК - 
//  Регистрация - ДокументСсылка.гкс_ТранспортныйДокумент - 
//  Регистрация - СправочникСсылка.ТранспортныеСредства - 
// 
// Возвращаемое значение:
//  Булево - Истина,  когда есть привязка регистрации и транспортного документа, иначе - Ложь 
//
Функция ДублированиеТДВРегистрации(Регистрация, ТранспортныйДокумент, ТранспортноеСредство) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации КАК ДокументРегистрации,
	|	СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент КАК ТранспортныйДокумент
	|ИЗ
	|	РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
	|ГДЕ
	|	НЕ СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации = &Регистрация
	|	И СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = &ТранспортныйДокумент
	|	И СвязьРегистрацииИТранспортногоДокумента.ТранспортноеСредство = &ТранспортноеСредство";
	
	Запрос.УстановитьПараметр("Регистрация", Регистрация);
	Запрос.УстановитьПараметр("ТранспортныйДокумент", ТранспортныйДокумент);
	Запрос.УстановитьПараметр("ТранспортноеСредство", ТранспортноеСредство);
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

// Получает Документы регистрации по транспортным документам.
// 
// Параметры:
//  ТранспортныеДокументы - Массив из ДокументСсылка.гкс_ТранспортныйДокумент - Транспортные документы для отбора.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Документы регистрации по транспортным документам
Функция ДокументыРегистрацииПоТранспортнымДокументам(ТранспортныеДокументы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТранспортныеДокументы", ТранспортныеДокументы);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации КАК ДокументРегистрации,
	|	СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент КАК ТранспортныйДокумент
	|ИЗ
	|	РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
	|ГДЕ
	|	СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент В (&ТранспортныеДокументы)";
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Зарегистрировать данные для обработки переноса связей
// 
// Параметры:
//  Параметры - Структура - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеДляЗаполненияТС(Параметры) Экспорт

	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыОтметкиОбработки();
	ДополнительныеПараметры.ЭтоНезависимыйРегистрСведений = Истина;
	ДополнительныеПараметры.ПолноеИмяРегистра = 
		Метаданные.РегистрыСведений.гкс_СвязьРегистрацииИТранспортногоДокумента.ПолноеИмя();
	Данные = ДанныеКОбработкеДляЗаполненияТС();
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, Данные, ДополнительныеПараметры);
		
КонецПроцедуры

// Обработчик обновления.
// 
// Параметры:
//  Параметры - Структура - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ОбработатьДанныеДляЗаполненияТС(Параметры) Экспорт
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.гкс_СвязьРегистрацииИТранспортногоДокумента;
	ПолноеИмяОбъекта = МетаданныеОбъекта.ПолноеИмя();
	
	ДополнительныеПараметры = ОбновлениеИнформационнойБазы.ДополнительныеПараметрыВыборкиДанныхДляОбработки();
	
	Выборка = ОбновлениеИнформационнойБазы.ВыбратьИзмеренияНезависимогоРегистраСведенийДляОбработки(
		Параметры.Очередь, ПолноеИмяОбъекта, ДополнительныеПараметры);
	
	Пока Выборка.Следующий() Цикл
		
		НачатьТранзакцию();
		Попытка
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить(ПолноеИмяОбъекта);
			ЭлементБлокировки.УстановитьЗначение("ДокументРегистрации", Выборка.ДокументРегистрации);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			Блокировка.Заблокировать();
			
			Набор = РегистрыСведений.гкс_СвязьРегистрацииИТранспортногоДокумента.СоздатьНаборЗаписей();
			Набор.Отбор.ДокументРегистрации.Установить(Выборка.ДокументРегистрации);
			Набор.Прочитать();
			
			ЗаполнитьТранспортноеСредствоВНаборе(Набор);
			
			ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(Набор);
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
	Если Параметры.ПрогрессВыполнения.ВсегоОбъектов = 0 Тогда
		Параметры.ПрогрессВыполнения.ВсегоОбъектов = КоличествоДанныхКОбработкеДляЗаполненияТС();
	КонецЕсли;
	
	Параметры.ПрогрессВыполнения.ОбработаноОбъектов  = 
		Параметры.ПрогрессВыполнения.ОбработаноОбъектов  + Выборка.Количество();
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(
		Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИБ

Функция ДанныеКОбработкеДляЗаполненияТС()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвязьРегистрацииИТранспортногоДокумента.ДокументРегистрации КАК ДокументРегистрации
	|ИЗ
	|	РегистрСведений.гкс_СвязьРегистрацииИТранспортногоДокумента КАК СвязьРегистрацииИТранспортногоДокумента
	|ГДЕ
	|	НЕ
	|		СвязьРегистрацииИТранспортногоДокумента.ТранспортныйДокумент = ЗНАЧЕНИЕ(Документ.гкс_ТранспортныйДокумент.ПустаяСсылка)
	|	И
	|		СвязьРегистрацииИТранспортногоДокумента.ТранспортноеСредство = ЗНАЧЕНИЕ(Справочник.ТранспортныеСредства.ПустаяСсылка)";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция КоличествоДанныхКОбработкеДляЗаполненияТС()
	Данные = ДанныеКОбработкеДляЗаполненияТС();
	Возврат Данные.Количество();
КонецФункции

Процедура ЗаполнитьТранспортноеСредствоВНаборе(Набор)
	
	Для Каждого Запись Из Набор Цикл
		
		Если НЕ ЗначениеЗаполнено(Запись.ДокументРегистрации) 
			Или ЗначениеЗаполнено(Запись.ТранспортноеСредство) Тогда
			Продолжить;
		КонецЕсли;
		
		ТСРегистрации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.ДокументРегистрации, "ТранспортноеСредство");
		Если ЗначениеЗаполнено(ТСРегистрации) Тогда
			Запись.ТранспортноеСредство = ТСРегистрации;
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
